weather_cpp/catkin_ws/src/weather_cpp/include/weather_cpp/ndfdXMLBinding.NDFDgen.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://graphical.weather.gov/xml/DWMLgen/schema/DWML.xsd"
  xmlns:ns1="http://graphical.weather.gov/xml/DWMLgen/wsdl/ndfdXML.wsdl">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:NDFDgen>
   <latitude></latitude>
   <longitude></longitude>
   <product>time-series</product>
   <startTime>2017-01-18T03:45:48Z</startTime>
   <endTime>2017-01-18T03:45:48Z</endTime>
   <Unit>e</Unit>
   <weatherParameters>
    <maxt>false</maxt>
    <mint>false</mint>
    <temp>false</temp>
    <dew>false</dew>
    <pop12>false</pop12>
    <qpf>false</qpf>
    <sky>false</sky>
    <snow>false</snow>
    <wspd>false</wspd>
    <wdir>false</wdir>
    <wx>false</wx>
    <waveh>false</waveh>
    <icons>false</icons>
    <rh>false</rh>
    <appt>false</appt>
    <incw34>false</incw34>
    <incw50>false</incw50>
    <incw64>false</incw64>
    <cumw34>false</cumw34>
    <cumw50>false</cumw50>
    <cumw64>false</cumw64>
    <critfireo>false</critfireo>
    <dryfireo>false</dryfireo>
    <conhazo>false</conhazo>
    <ptornado>false</ptornado>
    <phail>false</phail>
    <ptstmwinds>false</ptstmwinds>
    <pxtornado>false</pxtornado>
    <pxhail>false</pxhail>
    <pxtstmwinds>false</pxtstmwinds>
    <ptotsvrtstm>false</ptotsvrtstm>
    <pxtotsvrtstm>false</pxtotsvrtstm>
    <tmpabv14d>false</tmpabv14d>
    <tmpblw14d>false</tmpblw14d>
    <tmpabv30d>false</tmpabv30d>
    <tmpblw30d>false</tmpblw30d>
    <tmpabv90d>false</tmpabv90d>
    <tmpblw90d>false</tmpblw90d>
    <prcpabv14d>false</prcpabv14d>
    <prcpblw14d>false</prcpblw14d>
    <prcpabv30d>false</prcpabv30d>
    <prcpblw30d>false</prcpblw30d>
    <prcpabv90d>false</prcpabv90d>
    <prcpblw90d>false</prcpblw90d>
    <precipa_r>false</precipa_r>
    <sky_r>false</sky_r>
    <td_r>false</td_r>
    <temp_r>false</temp_r>
    <wdir_r>false</wdir_r>
    <wspd_r>false</wspd_r>
    <wwa>false</wwa>
    <wgust>false</wgust>
    <iceaccum>false</iceaccum>
    <maxrh>false</maxrh>
    <minrh>false</minrh>
   </weatherParameters>
  </ns1:NDFDgen>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
